// ------------------------------------
// パーツ自動展開ルール
// キー: パーツの文字
// 値: { same:[], lower1:[], lower2:[] }
//      same   : 同じ階層に追加 (k->k, k2->k2)
//      lower1 : 1つ下の階層に追加 (k->k2, k2->k3)
//      lower2 : 2つ下の階層に追加 (k->k3, k2->k3)
// ------------------------------------
const PART_EXPANSION = {
    "田": { 
        same: [], 
        lower1: ["ヨ", "口", "ロ", "日", "十", "コ", "干", "土"], 
        lower2: ["二", "ニ", "三", "ミ", "王", "ト", "士"] 
    },
    "言": { 
        same: ["口", "ロ"], 
        lower1: [], 
        lower2: [ "二", "三", "ニ", "ミ"] 
    },
    "音": { 
        same: ["立", "日"], 
        lower1: ["口", "ロ"], 
        lower2: [] 
    },
    "車": { 
        same: [], 
        lower1: ["日", "旦", "亘", "申", "口", "ロ", "田", "由", "甲", "三", "二", "ニ",], 
        lower2: ["ミ", "干", "土", "王", "ト", "士"] 
    },
    "門": { 
        same: [], 
        lower1: [], 
        lower2: ["日", "口", "ロ", "二", "三", "ニ", "ミ"] 
    },
    "口": { 
        same: ["ロ"], 
        lower1: ["コ"], 
        lower2: [] 
    },
    "日": { 
        same: [], 
        lower1: ["口", "ロ", "コ", "ヨ", "ト"], 
        lower2: ["ニ", "三", "二", "ミ"] 
    },
    "目": { 
        same: [], 
        lower1: [], 
        lower2: ["口", "ロ", "コ", "ヨ", "日", "ニ", "三", "二", "ミ"] 
    },
    "貝": { 
        same: ["目", "八", "ハ"], 
        lower1: [], 
        lower2: ["日", "口", "ロ", "コ", "ヨ", "日", "ニ", "三", "二", "ミ", "ト"] 
    },
    "糸": { 
        same: ["目", "八", "ハ"], 
        lower1: [], 
        lower2: ["日", "口", "ロ", "コ", "ヨ", "日", "ニ", "三", "二", "ミ", "ト"] 
    },
    "大": { 
        same: [], 
        lower1: ["ナ", "人"], 
        lower2: [] 
    },
    "エ": { 
        same: ["工"], 
        lower1: [], 
        lower2: [] 
    },
    "カ": { 
        same: ["力"], 
        lower1: ["刀"], 
        lower2: [] 
    },
    "タ": { 
        same: ["夕"], 
        lower1: ["ク","フ","ノ"], 
        lower2: [] 
    },
    "ト": { 
        same: ["卜"], 
        lower1: [], 
        lower2: [] 
    },
    "ニ": { 
        same: ["二"], 
        lower1: [], 
        lower2: [] 
    },
    "ヌ": { 
        same: ["又"], 
        lower1: ["フ"], 
        lower2: [] 
    },
    "ハ": { 
        same: ["八"], 
        lower1: ["ノ"], 
        lower2: [] 
    },
    "ミ": { 
        same: ["三"], 
        lower1: [], 
        lower2: [] 
    },
    "ロ": { 
        same: ["口", "コ"], 
        lower1: [], 
        lower2: [] 
    },
    "立": { 
        same: [], 
        lower1: ["ノ"], 
        lower2: ["ハ","八","ト","卜"] 
    },
    "木": { 
        same: [], 
        lower1: ["ノ","木"], 
        lower2: [] 
    },
    "云": { 
        same: [], 
        lower1: ["ニ","ム","二"], 
        lower2: [] 
    }
    // ここにルールを追加してください
};
